//-----------------------------------------------------------------------------
// File: executor_obj.h
// Desc: 基于对象的线程执行体，某个类通过继承该类得到某个函数的线程执行能力
//       继承该类的类对象必须自己实现run接口
// Auth: Aslan
// Date: 2009-12-09
// Last: 2009-12-09
//-----------------------------------------------------------------------------
#pragma once

#include "executor.h"

namespace ECore{

//-----------------------------------------------------------------------------
// 基于对象的线程执行体
//-----------------------------------------------------------------------------
class ECORE_API ExecutorObj : public Executor
{
public:
	ExecutorObj();
	virtual ~ExecutorObj();

	//-------------------------------------------------------------------------
	// 执行接口，继承ExecutroObj的类必须自己实现run
	//-------------------------------------------------------------------------
	virtual VOID	Run();

	//-------------------------------------------------------------------------
	// 提供关闭线程时的回调接口，只需要设置m_bTerminate就可以了
	//-------------------------------------------------------------------------
	virtual VOID	OnShutDown();

protected:
	BOOL volatile	m_bTerminate;		// 线程结束标志	
};

} // namespace ECore{