//-----------------------------------------------------------------------------
// File: task.cpp
// Desc: 任务执行体所执行的任务的抽象类，任何需要任务执行体执行的任务都需要从
//       该接口继承，并实现Do接口，任务执行体会直接调用该任务的Do接口以执行任务
// Auth: Aslan
// Date: 2009-12-09
// Last: 2009-12-09
//-----------------------------------------------------------------------------
#pragma once

#include "stdafx.h"
#include "task.h"

namespace ECore{

//-----------------------------------------------------------------------------
// 构造和析构
//-----------------------------------------------------------------------------
Task::Task()
{

}

Task::~Task()
{

}

} // namespace ECore{